% clc
% clear
% close all
%=======================拟合===================
% x=0:0.5:10;
% y=0.2*exp(-0.2*x)+0.5*exp(-0.15*x).*sin(1.25*x);
% net=newff(x,y,5,{'tansig','tansig'});%新语法
% net.trainParam.goal = 1e-5;
% net.trainParam.epochs = 300;
% net.trainParam.lr = 0.05;
% net.trainParam.showWindow = 0;%是否展示窗口
% net.divideFcn = ''; % 对于样本极少的情况，不要再三分了
% net = train(net,x,y);
% y2 = sim(net,x);
% figure
% plot(x,y,'r-',x,y2,'b-');
%======================回归========================
% x=[60693.7 121121
% 71176.6	122389
% 78973.0	123626
% 84402.3	124761
% 89677.1	125786
% 99214.6	126743
% 109655.2	127627
% 120332.7	128453
% 135822.8	129227
% 159878.3	129988
% 183867.9	130756
% 210871.0	131448
% 257305.6	132129
% 300670.0	132802
% 335629.2	133450
% 408903.0	134091
% 484123.5	134735
% 534123.0	135404
% 588018.8	136072
% 635910.2	136782
% 676708.3	137462]';%列数表示字段个数，行数表示样本数量
% y=[10023.4 10023.4
% 10764.3 10764.3
% 11273.6 11273.6
% 11590.4 11590.4
% 12305.2 12305.2
% 13472.7 13472.7
% 14632.6 14632.6
% 16330.7 16330.7
% 19032.2 19032.2
% 21972.3 21972.3
% 24940.8 24940.8
% 28588.4 28588.4
% 32632.0 32632.0
% 32711.8 32711.8
% 36430.3 36430.3
% 41923.4 41923.4
% 46928.0 46928.0
% 49592.8 49592.8
% 53223.5 53223.5
% 55233.6 55233.6
% 55500.6 55500.6]';


xa=reshape(ODt(:,:,1)',1,num_station^2);
ya=reshape(pop_xy(:,1:25)',1,pop_num*p.V);
x=[xa*0.98;xa*0.99;xa*0.89;xa*0.97;xa*1.01;xa*1.02;xa*1.01;xa*1.00;xa*0.99;xa*0.97]';
y=[ya*0.97;ya*0.97;ya*1.02;ya*1.02;ya*1.02;ya*1.02;ya*0.96;ya*1.03;ya*0.98;ya*1.00]';

x1=x(1:num_station^2,1:7);%训练输入数据
y1=y(1:pop_num*p.V,1:7);%训练输出数据
x2=x(1:num_station^2,8:10);%测试输入数据
y2=y(1:pop_num*p.V,8:10);%测试输出数据

net{1}=newff(x,y,5,{'logsig','purelin','traingd'});
net{1}.trainParam.goal = 1e-5;
net{1}.trainParam.epochs = 500;
net{1}.trainParam.lr = 0.05;
net{1}.trainParam.showWindow = 0;%是否展示窗口
%net.divideFcn = ''; % 对于样本极少的情况，不要再三分了

net{1} = train(net{1},x1,y1);

% net2=newff(x,y,5,{'logsig','purelin','traingd'});
% net2.IW=net.IW;
% net2.LW=net.LW;
% net2.b=net.b;
% net2 = train(net2,x2,y2);


y_result = sim(net{1},x);
figure
plot(1:10,y,'r-',1:10,y_result,'b-');

new_pop=reshape(y_result(:,10),p.V,pop_num)';%新的种群




